#ifndef __CORNER_H
#define __CORNER_H

//*********文件包含************
#include "stm32f10x.h"
#include "stm32f10x_conf.h"

//*********函数声明************
/*********************************************************************
//函数名称	:Corner_UpdataPram
//功能		:拐点模块更新变量
//备注		:
*********************************************************************/
void Corner_UpdataPram(void);
/*********************************************************************
//函数名称	:Corner_TimeTask
//功能		:拐点补传定时任务
//备注		:1秒调用1次
*********************************************************************/
FunctionalState  Corner_TimeTask(void);

#endif