/********************************************************************
//版权说明	:Shenzhen E-EYE Co. Ltd., Copyright 2009- All Rights Reserved.
//文件名称	:crypt.c		
//功能		:实现伪随机序列加密/解密功能
//版本号	:
//开发人	:dxl
//开发时间	:2010.2
//修改者	:
//修改时间	:
//修改简要说明	:
//备注		:
***********************************************************************/ 

//********************************头文件************************************
#include "include.h"
//********************************自定义数据类型****************************

//********************************宏定义************************************

//********************************全局变量**********************************
//*************本文件没有用到任何全局变量**************

//********************************外部变量**********************************

//********************************本地变量**********************************
//////////////////////
#define M1    65386045
#define IA1   90774844
#define IC1   86643539

//********************************函数声明**********************************

//********************************函数定义***********************************
/*********************************************************************
//函数名称	:Encrypt
//功能		:实现伪随机序列加密功能
//输入		:加密key值，pBuffer加密前的字节流首地址，加密前的字节流长度
//输出		:加密后的字符串
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:加密前与加密后字符串长度不变
*********************************************************************/
void Encrypt(u32 key, u8 *pBuffer,u16 size)
{   
	u16	idx;

	idx = 0;

	if(0 == key)	
	{
		key = 1;
	}
		
	while(idx < size)
	{
		key = IA1 * (key%M1) + IC1;
		pBuffer[idx++] ^= (u8)((key>>20)&0xff);	
	}
}
/*********************************************************************
//函数名称	:Decrypt
//功能		:实现伪随机序列解密功能
//输入		:解密key值，解密前的字节流，解密前的字节流长度
//输出		:解密后的字节流
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:加密前与加密后字符串长度不变
*********************************************************************/
void Decrypt(u32 key, u8 *pBuffer,u16 size)
{   
	u16	idx;

	idx = 0;

	if(0 == key)	
	{
		key = 1;
	}
		
	while(idx < size)
	{
		key = IA1 * (key%M1) + IC1;
		pBuffer[idx++] ^= (u8)((key>>20)&0xff);	
	}
}
/*********************************************************************
//函数名称	:main
//功能		:主函数，用于本文件的调试
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:
*********************************************************************/
#ifdef CRYPT_SINGLE_TEST
void CryptTestFun(void)
{
    u8 str1[1024] = "abcdefghijklmnopqrstuvwx`~!@#$%^&*DEFGHIJKLMNOPQRSTUVWXYZ0123456789"; 
    u8 str2[1024] = {0};

    strcpy(str2,str1);
    printf("\nstring before encrypt is: %s",str2);

    Encrypt(0x5050, str1, strlen(str1));
    printf("\nstring after encrypt is: %s",str1);

    Decrypt(0x5050, str1, strlen(str1));
    printf("\nstring after decrypt is: %s",str1);

    if(0 == strcmp(str1,str2))
    {
        printf("\nstring before encode == string after decode\n");
    }
    else
    {
        printf("\nstring before encode != string after decode\n");
    }

}
#endif

/*******************************************************************************
 *                             end of module
 *******************************************************************************/

