#ifndef __CRYPT_H
#define __CRYPT_H

/************************文件包含***********************/
#include "stm32f10x.h"

//**************************宏定义************************
//#define CRYPT_SINGLE_TEST	1
#define USE_CRYPT

//#define ENCRYPT_KEY_VALUE         70108//终端制造商ID
//********************自定义数据类型**************************

//***********************函数声明******************************
void Encrypt(u32 key, u8 *pBuffer,u16 size);
void Decrypt(u32 key, u8 *pBuffer,u16 size);
void CryptTestFun(void);
#endif
/*******************************************************************************
 *                             end of module
 *******************************************************************************/

