#ifndef __DOWNLOAD_GB2313_H
#define __DOWNLOAD_GB2313_H

//*********************头文件********************************
#include "stm32f10x.h"
#include "stm32f10x_conf.h"

//*********************自定义数据类型************************


//**********************宏定义********************************


//***********************函数声明********************************
/*********************************************************************
//函数名称	:EraseDownloadGB2313FlashArea()
//功能		:擦除下发国标汉字区域
//备注		:
*********************************************************************/
void EraseDownloadGB2313FlashArea(void);
/*********************************************************************
//函数名称	:EraseUpdataFlashArea
//功能		:擦除程序升级FLASH空间
//备注		:
*********************************************************************/
void EraseUpdataFlashArea(void);
/*********************************************************************
//函数名称	:DownloadGB2313_CheckFlashArea(void)
//功能		:检查下发国标汉字数据区域
//输入		:
//输出		: 
//返回		:无
//备注		:
*********************************************************************/
ErrorStatus   DownloadGB2313_CheckFlashArea(void);
/*********************************************************************
//函数名称	:DownloadGB2313_WriteToFlash(u8 *pBuffer, u16 length)
//功能		:写下发国标汉字到FLASH
//输入		:pBuffer，数据指针
//		:length，数据长度
//输出		:
//返回		:
//备注		:
*********************************************************************/
void DownloadGB2313_WriteToFlash(u8 *pBuffer, u16 length);
/*********************************************************************
//函数名称	:DownloadGB2313_ReadFromFlash(u8 Num, u8 *pBuffer)
//功能		:从FLASH里按序号读取下发国标汉字信息
//输入		:Num,序号。最新的那条信息为序号1，次新的那条信息为序号2，依此类推
//输出		: 
//返回		:pBuffer长度
//备注		:
*********************************************************************/
u8 DownloadGB2313_ReadFromFlash(u8 Num, u8 *pBuffer);
/*********************************************************************
//函数名称	:DownloadGB2313_GetTotalStep(void)
//功能		:获取下发国标汉字已存入的总步数
//输入		:
//返回		:
//备注		:
*********************************************************************/
u8 DownloadGB2313_GetTotalStep(void);
#endif
