/*******************************************************************************
 * File Name:		CommICCard.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:		Shigle
 * Date:		2013-01-14
 * Rewriter:
 * Date:		
 *******************************************************************************/

#ifndef __COMM_ICCARD_H_
#define __COMM_ICCARD_H_  

//==============  系统级任务  =============================/
/*************************************************************OK
** 函数名称: CommICCard_TimeTask
** 功能描述: 串口接收数据处理时间任务接口
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
**  备 注  :50毫秒调度1次
*************************************************************/
FunctionalState CommICCard_TimeTask(void);
/*************************************************************OK
** 函数名称: CommICCardInit
** 功能描述: //串口初始化
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void CommICCardInit(void);
/*************************************************************
** 函数名称: CommICCard_SendData
** 功能描述: 发送数据
** 入口参数: pBuffer源数据,BufferLen数据长度
** 出口参数: 无
** 返回参数: 0:成功；1:等待重发,2:失败,0xff:超出缓存长度
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char CommICCard_SendData(unsigned char *pBuffer, unsigned short BufferLen);

#endif


/*******************************************************************************
 *                             end of module
 *******************************************************************************/
