/*******************************************************************************
 * File Name:			Gnss_app.h 
 * Function Describe:	
 * Relate Module:		GNSS 模块控制
 * Writer:				Joneming
 * Date:				2013-12-11
 * ReWriter:			
 * Date:				
 *******************************************************************************/
#include "stm32f10x.h"

#ifndef __GNSS_APP__
#define __GNSS_APP__

typedef struct
{
    s16 	CurrentStep;	
    s16	  SectorStep;	
    s16	  LoopCount;	
    s16 	CurrentSector;	
    s16	  OldestSector;	
    s16	  StartSector;	
    s16	  EndSector;	
}HISTORY_AREA_STATUS;

/*************************************************************
** 函数名称: InitConfigGNSS
** 功能描述: 参数初始化GNSS模块
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void InitConfigGNSS(void);
/*************************************************************
** 函数名称: Gnss_App_TimeTask
** 功能描述: 未使用
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
FunctionalState Gnss_App_TimeTask(void);
/*************************************************************
** 函数名称: GnssRealData_TimeTask
** 功能描述: 实时解析新的数据，实时解析调用函数在 50ms调用一次
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
FunctionalState GnssRealData_TimeTask(void);
/*************************************************************
** 函数名称: GnssCheckChangePar
** 功能描述: 实时参数改变函数，根据设置调度此函数，改变采集频率，改变波特率,改变GNSS的采集模式 （北斗模式，GPS模式，双模式）
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void GnssCheckChangePar(void);
/*************************************************************
** 函数名称: EN_GnssArea
** 功能描述: 采集开启上传标志
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void EN_GnssArea(void);
/*************************************************************
** 函数名称: DIS_GnssArea
** 功能描述: 关闭上传标志
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void DIS_GnssArea(void);
/*************************************************************
** 函数名称: Gnss_CommRxIsr
** 功能描述: Gnss接收数据函数
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Gnss_CommRxIsr(unsigned char val);
/*************************************************************
** 函数名称: Gnss_StartBlindReport
** 功能描述: 开启Gnss盲区补报
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Gnss_StartBlindReport(void);
/*************************************************************
** 函数名称: Gnss_GetCurUpdateMode
** 功能描述: 取得当前定位数据上传方式
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Gnss_GetCurUpdateMode(void);
void Check_cmd_String(char * buff,u16 modem);

#endif

/*******************************************************************************
 *                             end of module
 *******************************************************************************/

