#ifndef __HEARTBEAT_H
#define __HEARTBEAT_H

//*********文件包含************
#include "stm32f10x.h"

//*********宏定义**************


//**********函数声明**********
/*********************************************************************
//函数名称	:Heartbeat_TimeTask(void)
//功能		:每隔一段时间（180s）上传一个数据包，保持线路连接
//输入		:无参数
//备注		:
*********************************************************************/
FunctionalState  HeartBeat_TimeTask(void);
/*********************************************************************
//函数名称	:Heartbeat_UpdatePram(void)
//功能		:更新心跳包时间间隔
//输入		:无参数
//备注		:
*********************************************************************/
void HeartBeat_UpdatePram(void);
/*********************************************************************
//函数名称	:Heartbeat_ClrHeartbeatCount(u8 channel)
//功能		:清除变量HeartbeatCount
//输入		:无参数
//输出		:
//使用资源	:
//全局变量	:
//调用函数	:
//中断资源	:  
//返回		:
//备注		:
*********************************************************************/
void Heartbeat_ClrHeartbeatCount(u8 channel);
#endif
