
#ifndef __LCD_H
#define __LCD_H

#include "stm32f10x.h"
#include "stm32f10x_conf.h"
#include "include.h"
extern u8	LcdOnOffFlag;//LCD屏亮和灭的标志,0为灭,1为亮

//*********宏定义****************

#define LCD_LIGHT_ON()  GpioOutOff(LCD_ON);LcdOnOffFlag = 1;
#define LCD_LIGHT_OFF() GpioOutOn(LCD_ON);LcdOnOffFlag = 0;

#define HARD_FAULT		0			//系统硬件错误
#define MEM_FAULT		1			//系统存储器错误
#define BUS_FAULT		2			//系统总线错误
#define USAGE_FAULT		3			//使用错误
#define NMI_FAULT		4			//不可屏蔽中断
////////////////////////////////////////
#define KEY_EXIT			KEY_VALUE1//退出
#define KEY_UP				KEY_VALUE2//上
#define	KEY_DOWN			KEY_VALUE3//下
#define KEY_OK				KEY_VALUE4//确认
#define TEMP_DATA_SIZE        5

////////////////////////////////////////////////
//*********函数声明**************
/*********************************************************************
//函数名称	:Lcd_ShowTextTimeTask(void)
//功能		:LCD显示文本信息（可能很长）
//输入		:信息存放在RadioProtocolDownLoadMsg缓冲里,
//		    :长度为RadioProtocolDownLoadMsgLen
//备注		:每次显示64个字节
*********************************************************************/
void Lcd_ShowText_EvTask(void);
/*********************************************************************
//函数名称	:Lcd_MainInterface(void)
//功能		:显示主界面
//备注		:
*********************************************************************/
void Lcd_MainInterface(void);
/*********************************************************************
//函数名称	:Lcd_MainInterface(void)
//功能		:显示主界面
//备注		:
*********************************************************************/
void LCD_TemperatureInterface(void);
void LCD_SpeedInterface(void);
void LCD_LoadInterface(void);
void LCD_DeepInterface(void);
/*********************************************************************
//函数名称  :Lcd_DisplayTemperature(void)
//功能      :显示主界面
//输入      :
//      :
//输出      :
//作者      :fanqinghai
//日期      :2015.07.07
*********************************************************************/
void Lcd_DisplayTemperature(void);
/*********************************************************************
//函数名称  :LCD_TurnSpeepInterface
//功能      :显示转速主界面
//输入      :
//      :
//输出      :
//使用资源  :
//全局变量  :   
//调用函数  :
//中断资源  :  
//返回      :
//备注      :0.5s调度一次
*********************************************************************/
void LCD_TurnSpeepInterface(void);
/*********************************************************************
//函数名称	:Lcd_CheckBeepFunction(void)
//功能		:蜂鸣器功能
//备注		:
*********************************************************************/
void Lcd_CheckBeepFunction(void);
/*********************************************************************
//函数名称	:Lcd_SetMainRedrawFlag(
//功能		:主界面刷新标志
//备注		:
*********************************************************************/
void Lcd_SetMainRedrawFlag(void);
/*********************************************************************
//函数名称	:RFLogin_EvTask(void)
//功能		:刷卡登录
//备注		:
*********************************************************************/
void RFLogin_EvTask(void);
/*********************************************************************
//函数名称	:Lcd_ClearDisplayCtrlFlag(void)
//功能		:清0DisplayControlFlag
//备注		:
*********************************************************************/
void Lcd_ClearDisplayCtrlFlag(void);
/*********************************************************************
//函数名称	:Lcd_SetDisplayCtrlFlag(void)
//功能		:设置DisplayControlFlag
//备注		:
*********************************************************************/
void Lcd_SetDisplayCtrlFlag(void);
/*********************************************************************
//函数名称	:Lcd_DisplaySystemTest(void)
//功能		:设置Lcd_DisplaySystemTest
//备注		:
*********************************************************************/
void Lcd_DisplaySystemTest(unsigned char type);
/*********************************************************************
//函数名称	:Lcd_SendTerminalLogout
//功能		:
//备注		:
*********************************************************************/
void Lcd_SendTerminalLogout(void);
/*********************************************************************
//函数名称	:Lcd_CheckCurStatus
//功能		:
//备注		:
*********************************************************************/
void Lcd_CheckCurStatus(void);
/*********************************************************************
//函数名称	:Lcd_GetDisplayCtrlFlag
//功能		:
//备注		:
*********************************************************************/
unsigned char Lcd_GetDisplayCtrlFlag(void);
/*************************************************************
** 函数名称: Lcd_SetSystemRFEnable
** 功能描述: 
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Lcd_SetSystemRFEnable(void);
/*************************************************************
** 函数名称: Lcd_ShowOnlyBigSpeed
** 功能描述: 
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
void Lcd_ShowOnlyBigSpeed(void);
/*************************************************************
** 函数名称: Lcd_CheckCurShowFlag
** 功能描述: 
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Lcd_CheckCurShowFlag(void);
/*************************************************************
** 函数名称: Lcd_ShowBigNumFlag
** 功能描述: 显示大字
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char Lcd_ShowBigNumFlag(void);
#endif
/*************************************************************
**  
*************************************************************/	
