#ifndef __LOCK2_H
#define __LOCK2_H

#include "stm32f10x.h"

/**************************************************************************
//函数名：Lock2_TimeTask
//功能：实现锁定二功能
//输入：无
//输出：无
//返回值：始终是ENABLE
//备注：锁定二定时任务，1秒钟进入1次，任务调度器需要调用此函数
***************************************************************************/
FunctionalState Lock2_TimeTask(void);
/**************************************************************************
//函数名：Lock2_UpdataParameter
//功能：更新相关参数
//输入：无
//输出：无
//返回值：无
//备注：当设置参数（主服务器、备份服务器、锁定二使能）时需要调用该函数
***************************************************************************/
void Lock2_UpdataParameter(void);
/**************************************************************************
//函数名：Lock2_OpenAccountAck
//功能：处理快速开户应答
//输入：无
//输出：无
//返回值：无
//备注：当收到平台快速开户应答时调用该函数
***************************************************************************/
void Lock2_OpenAccountAck(u8 *pBuffer, u16 BufferLen);
/**************************************************************************
//函数名：Lock2_GetOpenAccountFlag
//功能：获取快速开户标志
//输入：无
//输出：无
//返回值：1:为已开户；0:未开户
***************************************************************************/
u8 Lock2_GetOpenAccountFlag(void);
/**************************************************************************
//函数名：Lock2_GetLock2Flag
//功能：获取锁定二标志
//输入：无
//输出：无
//返回值：1:为锁定；0:为未锁定
***************************************************************************/
u8 Lock2_GetLock2Flag(void);
/**************************************************************************
//函数名：Lock2_GetEnableFlag
//功能：获取锁定二使能标志
//输入：无
//输出：无
//返回值：1:为使能;0:为不使能
***************************************************************************/
u8 Lock2_GetEnableFlag(void);
/**************************************************************************
//函数名：Lock2_OpenAccountOnline
//功能：置位OpenAccountOnline
//输入：无
//输出：无
//返回值：1：当前为快速开户连接；0：当前为其它连接（正常应用时属这种情况）
//备注：当通信模块连网成功后需调用此函数
***************************************************************************/
void Lock2_OpenAccountOnline(void);
/**************************************************************************
//函数名：Lock2_GetOpenAccountRequestFlag
//功能：获取OpenAccountRequestFlag
//输入：无
//输出：无
//返回值：1：有快速开户需求；0：无快速开户需求
//备注：当通信模块连网成功后需调用此函数
***************************************************************************/
u8 Lock2_GetOpenAccountRequestFlag(void);
/**************************************************************************
//函数名：Lock2_TrigOpenAccount
//功能： 触发快速开户
//输入：无
//输出：无
//返回值：无
//备注：当收到平台快速开户应答时调用该函数
***************************************************************************/
void Lock2_TrigOpenAccount(void);
/**************************************************************************
//函数名：Lock2_TrigOpenAccount
//功能： 触发快速开户
//输入：无
//输出：无
//返回值：无
//备注：当收到平台快速开户应答时调用该函数
***************************************************************************/
void Lock2_TrigOpenAccount(void);
#endif