#ifndef __LOCK1_H
#define __LOCK1_H

#include "stm32f10x.h"

/**************************************************************************
//函数名：Lock1_TimeTask
//功能：实现锁定一功能
//输入：无
//输出：无
//返回值：始终是ENABLE
//备注：锁定一定时任务，1秒钟进入1次，任务调度器需要调用此函数
***************************************************************************/
FunctionalState Lock1_TimeTask(void);

/**************************************************************************
//函数名：Lock1_UpdataParameter
//功能：更新相关参数
//输入：无
//输出：无
//返回值：无
//备注：当设置参数（主服务器、备份服务器、锁定一使能）时需要调用该函数
***************************************************************************/
void Lock1_UpdataParameter(void);

/**************************************************************************
//函数名：Lock1_GetLock1Flag
//功能：获取锁定一标志
//输入：无
//输出：无
//返回值：无
//备注：1为锁定；0为未锁定
***************************************************************************/
u8 Lock1_GetLock1Flag(void);

#endif