/*******************************************************************************
 * File Name:			OilControl.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:				joneming
 * Date:				2012-12-05
 * Rewriter:
 * Date:		
 *******************************************************************************/
#include "stm32f10x.h"

#ifndef __OILCONTROL_H_
#define __OILCONTROL_H_  

/*******************************************************************************
**  函数名称  : ControlOil_TimeTask
**  函数功能  : 油路控制任务调度接口函数
**  输    入  : 无				
**  输    出  : 任务调度状态:  使能或禁止
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
FunctionalState ControlOil_TimeTask(void);
/*******************************************************************************
**  函数名称  : OilControl_ParameterInitialize
**  函数功能  : 断油路初始化
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void OilControl_ParameterInitialize(void);
/*******************************************************************************
**  函数名称  : OilControl_OpenOil
**  函数功能  : 通油
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void OilControl_OpenOil(void);
/*******************************************************************************
**  函数名称  : OilControl_OffOil
**  函数功能  : 断油
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void OilControl_OffOil(void);
#endif//__OILCONTROL_H_
/*******************************************************************************
 *                             end of module
 *******************************************************************************/
