/*******************************************************************************
 * File Name:			OpenAccount.h 
 * Function Describe:	
 * Relate Module:		快速开户功能
 * Writer:				Joneming
 * Date:				2013-06-17
 * ReWriter:			
 * Date:				
 *******************************************************************************/
#include "stm32f10x.h"
#ifndef __OPENACCOUNT_H_
#define __OPENACCOUNT_H_

#define USE_QUICK_OPEN_ACCOUNT
/////////////////以下宏为使用哪个地址暂存开户服务器地址及端口号//////////////////
#define E2_OPEN_ACCOUNT_PARAM_IP_ID     E2_UPDATA_IP_ID
#define E2_OPEN_ACCOUNT_PARAM_TCP_ID    E2_UPDATA_TCP_PORT_ID


#define E2_OPEN_ACCOUNT_PARAM_BACK_IP_ID    E2_IC_BACKUP_SERVER_IP_ID
/*************************************************************
** 函数名称: OpenAccount_ClearLockStatus
** 功能描述: 快速开户清除锁定状态
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void OpenAccount_ClearLockStatus(void);
/*************************************************************
** 函数名称: OpenAccount_SetLockStatus
** 功能描述: 快速开户置为锁定状态
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void OpenAccount_SetLockStatus(void);
/*************************************************************
** 函数名称: OpenAccount_CheckAndDisposeLockStatus
** 功能描述: 检查和处理快速开户锁定状态
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void OpenAccount_CheckAndDisposeLockStatus(void);
/*************************************************************
** 函数名称: OpenAccount_GetCurLockStatus
** 功能描述: 获得快速开户当前锁定/解锁状态
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char OpenAccount_GetCurLockStatus(void);
/*************************************************************
** 函数名称: OpenAccountParameterInitialize
** 功能描述: 快速开户参数初始化
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void OpenAccount_ParameterInitialize(void);
/*************************************************************
** 函数名称: OpenAccount_TimeTask
** 功能描述: 快速开户定时器处理函数
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
FunctionalState OpenAccount_TimeTask(void);
/*************************************************************
** 函数名称: OpenAccount_DisposeRadioProtocol
** 功能描述: 快速开户协议解析
** 入口参数: pBuffer:数据首地址,BufferLen:数据长度
** 出口参数: 无
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void OpenAccount_DisposeRadioProtocol(unsigned char *pBuffer,unsigned short BufferLen);
/*************************************************************
** 函数名称: OpenAccount_GetEncryptFlag
** 功能描述: 是否加密
** 入口参数: 
** 出口参数: 无
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char OpenAccount_GetEncryptFlag(void);
/*************************************************************
** 函数名称: Check_Result
** 功能描述: 检查开户结果
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Check_Result(void);


#endif

/*******************************************************************************
 *                             end of module
 *******************************************************************************/
 
