#ifndef __PACKET_UPDATE_H
#define __PACKET_UPDATE_H

#include "stm32f10x.h"

/**************************************************************************
//函数名：PacketUpdate_TimeTask
//功能：实现分包升级功能
//输入：无
//输出：无
//返回值：始终是ENABLE
//备注：分包升级定时任务，1秒钟进入1次，任务调度器需要调用此函数
***************************************************************************/
FunctionalState PacketUpdate_TimeTask(void);
/**************************************************************************
//函数名：PacketUpdate_HandleCmd8108H
//功能：处理平台下发的0x8108指令
//输入：无
//输出：无
//返回值：始终是ENABLE
//备注：分包升级定时任务，1秒钟进入1次，任务调度器需要调用此函数
***************************************************************************/
void PacketUpdate_HandleCmd8108H(u8 *pBuffer, u16 BufferLen);


#endif