/*******************************************************************************
 * File Name:			phone.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:				joneming
 * Date:				2014-06-19
 * Rewriter:
 * Date:		
 *******************************************************************************/
#include "stm32f10x.h"

#ifndef __PHONE_H
#define __PHONE_H
///////////////////////////
#ifdef EYE_MODEM
#define USE_PHONE
//*********************头文件********************************
//////////////////////////////////
//***********************函数声明********************************
/*************************************************************
** 函数名称: Phone_ParamInitialize
** 功能描述: 参数初始化
** 入口参数: 
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Phone_ParamInitialize(void);
/*************************************************************
** 函数名称: Phone_GetEachMaxTalkTime
** 功能描述: 
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
unsigned long Phone_GetEachMaxTalkTime(void);
/*************************************************************
** 函数名称: Phone_GetOverMonthTalkTimeFlag
** 功能描述: 获得超过当月通话时间标志
** 入口参数: 
** 出口参数: 
** 返回参数: 1:超过,0:未超过
** 全局变量: 无
** 调用模块:
*************************************************************/
unsigned char Phone_GetOverMonthTalkTimeFlag(void);
/*************************************************************
** 函数名称: Phone_DisposePhoneStatus
** 功能描述: 处理电话状态命令
** 入口参数: phone:电话号码,status:电话状态：0：为挂断;1:接通;2:新来电;
** 出口参数: 无
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Phone_DisposePhoneStatus(unsigned char *phone,unsigned char status);
/*******************************************************************************
* Function Name  : Phone_SetDialEvTask
* Description    : 电话回拨
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void Phone_SetDialEvTask(void);
/*************************************************************
** 函数名称: Phone_SetPhoneSpecialFlag
** 功能描述: 设置电话号码特权标志
** 入口参数: 
** 出口参数: 无
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void Phone_SetPhoneSpecialFlag(unsigned char value);
/*************************************************************OK
** 函数名称: Phone_UpdateMaxPhoneTimeMonth
** 功能描述: 更新参数
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void Phone_UpdateMaxPhoneTimeMonth(void);
/*************************************************************OK
** 函数名称: Phone_UpdateMaxPhoneTimeEach
** 功能描述: 更新参数
** 入口参数:  
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void Phone_UpdateMaxPhoneTimeEach(void);
/*******************************************************************************
**  函数名称  : Phone_TimeTask
**  函数功能  : 时间任务调度接口函数
**  输    入  : 无				
**  输    出  : 任务调度状态:  使能或禁止
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
FunctionalState Phone_TimeTask(void);
#endif
#endif//__Phone_H
/*******************************************************************************
 *                             end of module
 *******************************************************************************/

