/*******************************************************************************
 * File Name:			PhoneBook.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:				joneming
 * Date:				2013-09-02
 * Rewriter:
 * Date:		
 *******************************************************************************/
#include "Public.h"
#include "LzmSys.h"
#ifndef __PHONEBOOK_H
#define __PHONEBOOK_H

#define USE_PHONE_BOOK
/*************************************************************
** 函数名称: PhoneBook_CallRecordDeleteAll
** 功能描述: 删除所有通话记录内容
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void PhoneBook_CallRecordDeleteAll(void);
/*************************************************************
** 函数名称: TaskMenuPhone
** 功能描述: "电话"菜单
** 入口参数: 无
** 出口参数: 无
** 返回参数: 无
** 全局变量: 
** 调用模块: 
*************************************************************/	
LZM_RET TaskMenuPhone(LZM_MESSAGE *Msg);
/*************************************************************
** 函数名称: PhoneBook_ReadAndCheckCallRecord
** 功能描述: 删除所有通话记录内容
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 
*************************************************************/
void PhoneBook_ReadAndCheckCallRecord(void);
/*************************************************************
** 函数名称: Public_DisposePhoneStatus
** 功能描述: 处理电话状态命令
** 入口参数: phone:电话号码,status:电话状态：0：为挂断;1:接通;2:新来电;
** 出口参数: 无
** 返回参数: 如果是电话呼入状态为新来电时,返回值:0:直接拒接来电;1:正在等待用户接听来电
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char PhoneBook_DisposePhoneStatus(unsigned char *phone,unsigned char status);
/*************************************************************
** 函数名称: PhoneBook_CheckPhoneCallResult
** 功能描述: 检查电话号码及呼叫结果
** 入口参数: phone电话号码,newname名字
** 出口参数: 无
** 返回参数: 0呼叫成功
** 全局变量: 
** 调用模块: 
*************************************************************/	
unsigned char PhoneBook_CheckPhoneCallResult(unsigned char *phone,unsigned char *newname);
#endif//__PHONEBOOK_H
/*******************************************************************************
 *                             end of module
 *******************************************************************************/

