/*******************************************************************************
 * File Name:			route.h 
 * Function Describe:	
 * Relate Module:		线路检测
 * Writer:				Joneming
 * Date:				2013-10-17
 * ReWriter:			
 * Date:				
 *******************************************************************************/
#ifndef __ROUTE_H_
#define __ROUTE_H_

#include "include.h"
///////////////////////
#define ROUTE_NUM_MAX           24   //最多线路数
#define ROUTE_NODE_SUM          160  //一条线路最多包含的节点数
/////////////////////////////
//进出线路报警类型  
typedef enum{
    E_NO_AREA=0,        //无
    E_ROUND_AREA,       //圆
    E_RECT_AREA,        //矩形
    E_POLYGON_AREA,     //多边形
    E_ROUTE             //线路
}IN_OUT_ROUTE_TYPE;
/////////////////////////////////
//****************函数声明*******************
/*************************************************************
** 函数名称: ClrRoute
** 功能描述: 把线路数据区清空
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
void ClrRoute(void);                   //清空线路
/********************************************************************
* 功能 : 初始化线路
* 输入:  
* 输出: 
* 全局变量: 
*
* 备注: 确定线路总数,必要的复位参数
********************************************************************/ 
void InitRoute(void);                  //初始化线路
/********************************************************************
* 功能 : 线路检测任务函数
* 输入: 
* 输出: 
* 全局变量: 
*
* 备注:每1s执行一次
********************************************************************/  
FunctionalState Route_TimeTask(void);
/*******************************************************************************
** 函数名称: Route_GetInOutAlarmSubjoinInfo
** 功能描述: 获取进出路线报警附加信息包(包括附加信息ID、长度、附加信息体) :即附加信息ID为0x12的所有内容
** 入口参数: 需要保存进出路线报警附加信息包的首地址
** 出口参数: 
** 返回参数: 进出路线报警附加信息包的总长度,0:表示未进出路线,
*******************************************************************************/
unsigned char Route_GetInOutAlarmSubjoinInfo(unsigned char *data);
/*************************************************************
** 函数名称: Route_GetDriveAlarmInfoSubjoinInfo
** 功能描述: 获取路段行驶时间不足/过长报警附加信息包(包括附加信息ID、长度、附加信息体) :即附加信息ID为0x13的所有内容
** 入口参数: 需要保存行驶时间报警附加信息包的首地址
** 出口参数: 
** 返回参数: 行驶时间报警附加信息包的总长度,0:表示未报警,
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Route_GetDriveAlarmInfoSubjoinInfo(unsigned char *data);

/*************************************************************
** 函数名称: Route_GetDeviationAlarmInfo
** 功能描述: 获取路线偏离报警附加信息(包括附加信息ID、长度、附加信息体) :即附加信息ID为0x13的所有内容
** 入口参数: 需要保存路线偏离报警附加信息包的首地址
** 出口参数: 
** 返回参数: 路线偏离报警附加信息包的总长度,0:表示未报警,
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Route_GetDeviationAlarmInfo(unsigned char *data); 

/*************************************************************
** 函数名称: Route_DisposeSetRoad
** 功能描述: :设置路线
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Route_DisposeSetRoad(unsigned char flag,unsigned char *pBuffer, unsigned short BufferLen);
/*************************************************************
** 函数名称: Route_DisposeSetRoad
** 功能描述: :删除路线
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
unsigned char Route_DisposeDelRoad(unsigned char *pBuffer, unsigned short BufferLen);
/*************************************************************
** 函数名称: Route_UpdatePram
** 功能描述: 设置或修改线路相关变量后,需要更线路速模块相关变量
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/
void Route_UpdatePram(void);
/*************************************************************OK
** 函数名称: Route_GetPointDistance
** 功能描述: 地球上位置点直接的距离运算(米)
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块:
*************************************************************/ 
double Route_GetPointDistance(T_GPS_POS *Point1,T_GPS_POS *Point2);
#endif//#ifndef __ROUTE_H_

/*******************************************************************************
 *                             end of module
 *******************************************************************************/

