/*******************************************************************************
 * File Name:			SleepDeep.h 
 * Function Describe:	
 * Relate Module:		
 * Writer:				Joneming
 * Date:				2013-07-16
 * ReWriter:			
 * Date:				
 *******************************************************************************/
#ifndef __SLEEPDEEP__H
#define __SLEEPDEEP__H
/*******************************************************************************/

/*******************************************************************************
**  函数名称  : SleepDeep_RTC_WKUP_IRQ
**  函数功能  : 定时器中断处理
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void SleepDeep_RTC_WKUP_IRQ(void);
/*******************************************************************************
**  函数名称  : SleepDeep_ACC_EXTI_IRQ
**  函数功能  : Acc中断处理
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void SleepDeep_ACC_EXTI_IRQ(void);
/*******************************************************************************
**  函数名称  : SleepDeep_SetExtiTypeBreak
**  函数功能  : 
**  输    入  : 无 
**  输    出  :  
**  全局变量  : 
**  调用函数  : 无
**  中断资源  : 无
**  备    注  :
*******************************************************************************/
void SleepDeep_SetExtiTypeBreak(void);
/*******************************************************************************
**  函数名称  : SleepDeep_ParameterInitialize
**  函数功能  : 深度休眠初始化
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void SleepDeep_ParameterInitialize(void);
/*******************************************************************************
**  函数名称  : SleepDeep_UpdateParam
**  函数功能  : 深度休眠
**  输    入  : 无				
**  输    出  : 
**  全局变量  : 
**  调用函数  : 
**  中断资源  : 
**  备    注  :
*******************************************************************************/
void SleepDeep_UpdateParam(void);
/*************************************************************
** 函数名称: SleepDeep_TimeTask
** 功能描述: 定时器处理函数
** 入口参数: 
** 出口参数: 
** 返回参数: 
** 全局变量: 无
** 调用模块: 无
*************************************************************/
FunctionalState SleepDeep_TimeTask(void);
/*******************************************************************************
**  函数名称  : SleepDeep_EnterStopMode
**  函数功能  : 判断是否退出STOP MODE
**  输    入  : 无
**  输    出  : 
 
**  全局变量  : 
**  调用函数  : 无
**  中断资源  : 无
**  备    注  :
*******************************************************************************/
void SleepDeep_EnterStopMode(void);
/*******************************************************************************
**  函数名称  : SleepDeep_DisposeTerminalShutdown
**  函数功能  : 处理终端关机命令,Acc开延时2秒重启,Acc关延时2秒进入深度休眠,
                只要当前电压再升高0.5v或者由Acc关变为Acc开即重新开机
**  输    入  : 无
**  输    出  :  
**  全局变量  : 
**  调用函数  : 无
**  中断资源  : 无
**  备    注  :
*******************************************************************************/
void SleepDeep_DisposeTerminalShutdown(void);
#endif//__SLEEPDEEP__H
/*******************************************************************************
 *                             end of module
 *******************************************************************************/

