#ifndef __VSS_H
#define __VSS_H

//*************文件包含***************
#include "stm32f10x_gpio.h"
#include "stm32f10x.h"

//*************宏定义****************

//************结构体类型******************

//*************函数声明**************
/**************************************************************************
//函数名：Vss_TimeTask
//功能：VSS连接异常判断
//输入：无
//输出：无
//返回值：始终是ENABLE
//备注：VSS连接异常定时任务，1秒钟进入1次，任务调度器需要调用此函数
***************************************************************************/
FunctionalState Vss_TimeTask(void);

#endif
