#ifndef __VDR_DOUBT_H
#define __VDR_DOUBT_H

#include "stm32f10x.h"



/**************************************************************************
//函数名：VDRDoubt_TimeTask
//功能：实现疑点数据的记录
//输入：无
//输出：无
//返回值：始终是ENABLE
//备注：疑点数据定时任务，50ms进入1次，任务调度器需要调用此函数
***************************************************************************/
FunctionalState VDRDoubt_TimeTask(void);
/**************************************************************************
//函数名：VDRDoubt_GetCarRunFlag
//功能：获取车辆行驶标志
//输入：无
//输出：无
//返回值：1为行驶，0为停驶
//备注：行驶速度大于0持续10秒为行驶，速度等于0持续10秒为停驶
***************************************************************************/
u8 VDRDoubt_GetCarRunFlag(void);

#endif

